docs/pytut-flow.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-02-20 Thu 12:10 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>ZIO Tutorial: Flow</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Brett Viren" />
<link rel="stylesheet" type="text/css" href="org.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content">
<h1 class="title">ZIO Tutorial: Flow</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb127b6c">1. Create a flow</a></li>
<li><a href="#org2872f77">2. Start a flow</a></li>
<li><a href="#org7097ccd">3. Perform data flow</a></li>
<li><a href="#org15d4246">4. Counting messages</a></li>
<li><a href="#org2527a32">5. Blocking</a></li>
<li><a href="#orgde87aa7">6. End a flow</a></li>
</ul>
</div>
</div>
<div class="nav">
<ul class="org-ul">
<li><a href="index.html">Main Page</a></li>
<li><a href="install.html">Installation</a></li>
<li><a href="tutorial.html">Tutorials</a></li>
<li><a href="whytos.html">Design documents</a></li>
<li><a href="api.html">API Reference</a></li>
</ul>

</div>

<p>
ZIO provides <code>zio.flow.Flow</code> class to provide Python side implementation
of the ZIO data flow protocol (see <a href="flow.html">flow writeup</a>).  
</p>

<div id="outline-container-orgb127b6c" class="outline-2">
<h2 id="orgb127b6c"><span class="section-number-2">1</span> Create a flow</h2>
<div class="outline-text-2" id="text-1">
<p>
The flow object requires an externally prepared port to be provided.
The port may be created stand-alone (see <a href="pytut-port.html">port tutorial</a>) but is more
simply and usefully created in a node (see <a href="pytut-node.html">node tutorial</a>).  Here we do
the latter:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">import</span> zio, zmq
<span style="font-weight: bold; font-style: italic;">node</span> = zio.Node(<span style="font-style: italic;">"mynode"</span>)
<span style="font-weight: bold; font-style: italic;">port</span> = node.port(<span style="font-style: italic;">"myflow"</span>, zmq.CLIENT)
port.bind()
node.online()
<span style="font-weight: bold; font-style: italic;">flow</span> = zio.flow.Flow(port)
</pre>
</div>

<p>
Notes:
</p>

<ul class="org-ul">
<li>The application is free to bring the node, and thus the port online
either before or after the flow is created.  They must, of course,
be online prior to using the flow object to exercise the flow
protocol.</li>

<li>The ZIO flow protocol typically uses CLIENT/SERVER sockets and the
<code>zio.flow.Flow</code> object typically is used for the CLIENT side.  As
expert level use, it can also provide the SERVER role.</li>
</ul>
</div>
</div>

<div id="outline-container-org2872f77" class="outline-2">
<h2 id="org2872f77"><span class="section-number-2">2</span> Start a flow</h2>
<div class="outline-text-2" id="text-2">
<p>
The ZIO data flow protocol starts with both sides shaking hands to
determine their mutually opposing <i>directions</i> and their agreed on
number of flow control <i>credit</i>.  This is done by exchanging a flow
<i>begin-of-transmission</i> (<b>BOT</b>) message.  From the point of view of a flow
client:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">cbot</span> = Message(label=<span style="font-style: italic;">'{"credit":2,"direction":"inject"}'</span>)
flow.send_bot(cbot)
<span style="font-weight: bold; font-style: italic;">sbot</span> = flow.recv_bot(1000);
<span style="font-weight: bold; font-style: italic;">fobj</span> = json.loads(sbot.label)
<span style="font-weight: bold;">assert</span>(fobj[<span style="font-style: italic;">'direction'</span>] == <span style="font-style: italic;">'extract'</span>)
<span style="font-weight: bold; font-style: italic;">total_credit</span> = fobj[<span style="font-style: italic;">'credit'</span>]
</pre>
</div>

<p>
The server is similar but it must first call <code>recv_bot()</code> and then
<code>send_bot()</code>.  In between it must accept the clients <i>direction</i> and
accept or lower the client's suggested <i>credit</i> and return the result.
If the server does not accept then it returns an <b>EOT</b> message.
</p>

<p>
Note the required <code>form='FLOW'</code> message header and the <code>flow='BOT'</code>
attribute of the flow object in the message '.label' are both set
implicitly inside the <code>flow.send_bot()</code> method so the application need
not be concerned.
</p>
</div>
</div>

<div id="outline-container-org7097ccd" class="outline-2">
<h2 id="org7097ccd"><span class="section-number-2">3</span> Perform data flow</h2>
<div class="outline-text-2" id="text-3">
<p>
The actual "flowing" phase of the data flow protocol involves explicit
exchange of "payload" <b>DAT</b> messages and implicit exchange of <b>PAY</b>
messages traveling in opposite directions.  
</p>

<p>
A flow which has direction "inject" will receive payload messages:
</p>

<div class="org-src-container">
<pre class="src src-python">flow.flush_pay()

<span style="font-weight: bold; font-style: italic;">timeout</span> = 1000 <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">[ms]</span>
<span style="font-weight: bold; font-style: italic;">dat</span> = flow.get(timeout)
<span style="font-weight: bold;">if</span> <span style="font-weight: bold;">not</span> dat:
    <span style="font-weight: bold;">print</span>(<span style="font-style: italic;">"timeout"</span>)
<span style="font-weight: bold;">else</span>:
    <span style="font-weight: bold;">print</span> (f<span style="font-style: italic;">'got payload {dat}'</span>)
</pre>
</div>

<p>
Note the call to <code>flow.flush_pay()</code>.  The other end shall not send <b>DAT</b>
messages until it has credit and it starts out with none.  This means
the receiving end must signal it is ready to get flow.  It does this
by explicitly sending some initial credit (ie, all of it) to the other
end with <code>flush_pay()</code>.  
</p>

<p>
Note, in this particular example, the call is redundant as
<code>flow.flush_pay()</code> is called at the start of a <code>flow.get()</code>.  However, it
is typical for applications to rely on a ZeroMQ "poller" to watch the
client socket for waiting messages before calling <code>flow.get()</code>.  In such
a case, no <b>DAT</b> will come because the other end is waiting for <b>PAY</b> and
no <b>PAY</b> will be sent because the receiving end is waiting for <b>DAT</b>.
Thus an explicit, initial call to <code>flow.flush_pay()</code> is needed to break
the deadlock.
</p>

<p>
Goign the other way, a flow which has direction "extract" might send
payload messages simply like:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">dat</span> = zio.Message(...)
flow.put(dat)
</pre>
</div>

<p>
In this case there is an analogue to <code>flow.flush_pay()</code> called
<code>flow.slurp_pay()</code>.  This may be explicitly called but it is called in
<code>flow.put()</code> and no deadlock should arise.
</p>
</div>
</div>

<div id="outline-container-org15d4246" class="outline-2">
<h2 id="org15d4246"><span class="section-number-2">4</span> Counting messages</h2>
<div class="outline-text-2" id="text-4">
<p>
The Python (and C++) implementation of ZIO data flow requires that the
<b>seqno</b> field in message from any flow port is strictly incrementing,
starting with a value of 0 for the <b>BOT</b>.  It is up to the application
to assure this for the initial <b>BOT</b> and subsequent <b>DAT</b> and final <b>EOT</b>.
Ignoring details like actual payload, a flow sender might then:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">msg</span> = zio.Message()
<span style="font-weight: bold;">for</span> count <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(100):
    <span style="font-weight: bold; font-style: italic;">msg.seqno</span> = count
    flow.put(dat)
<span style="font-weight: bold; font-style: italic;">msg.seqno</span> = count+1
flow.send_eot(msg)
</pre>
</div>

<p>
And a flow receiver:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">msg</span> = flow.recv_bot()
<span style="font-weight: bold;">assert</span>(msg.seqno == 0)
<span style="font-weight: bold; font-style: italic;">last_seqno</span> = 0
<span style="font-weight: bold;">while</span> <span style="font-weight: bold; text-decoration: underline;">True</span>:
    <span style="font-weight: bold; font-style: italic;">msg</span> = flow.get()
    <span style="font-weight: bold;">if</span> <span style="font-weight: bold;">not</span> msg:
        <span style="font-weight: bold;">break</span>
    <span style="font-weight: bold;">assert</span>(msg.seqno - last_seqno == 1)
    <span style="font-weight: bold; font-style: italic;">last_seqno</span> += 1
flow.send_eot()
</pre>
</div>
</div>
</div>

<div id="outline-container-org2527a32" class="outline-2">
<h2 id="org2527a32"><span class="section-number-2">5</span> Blocking</h2>
<div class="outline-text-2" id="text-5">
<p>
The ZIO data flow protocol is designed to maximize high throughput
while minimizing keeping latency and bounding memory usage.  However,
both the <code>get()</code> and the <code>put()</code> may still block:
</p>

<ul class="org-ul">
<li>a <code>get()</code> will block if the other end ceases to send <b>DAT</b> and the local end exhausts the queue.</li>
<li>a <code>put()</code> will block if the local end ceases to send <b>PAY</b> and the local end has used all accumulated <i>credit</i>.</li>
</ul>

<p>
If blocks occur do to variation in message processing time increasing
the total amount of <i>credit</i> will use more memory but may smooth out the
resulting latency variation.  
</p>

<p>
An important and desirable cause of blocking in the ZIO data flow
control protocol is discussed next.
</p>
</div>
</div>

<div id="outline-container-orgde87aa7" class="outline-2">
<h2 id="orgde87aa7"><span class="section-number-2">6</span> End a flow</h2>
<div class="outline-text-2" id="text-6">
<p>
The final stage of the ZIO data flow protocol is its
<i>end-of-transmission</i> (<b>EOT</b>) message.  Like with <b>BOT</b> this is a handshake
between both endpoints.  One endpoint must initiate <b>EOT</b> which means
the other endpoint will have a "surprise discovery" while it is either
expecting a <b>BOT</b>, a <b>DAT</b> or a <b>PAY</b> message.  In the first case, the code
might be like:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">initiate EOT</span>
flow.send_eot()
<span style="font-weight: bold; font-style: italic;">timeout</span> = 10000 <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">[ms]</span>
<span style="font-weight: bold; font-style: italic;">eot</span> = flow.recv_eot(timeout)
<span style="font-weight: bold;">if</span> <span style="font-weight: bold;">not</span> eot:
    <span style="font-weight: bold;">print</span>(<span style="font-style: italic;">"EOT timeout, may have lost data"</span>
</pre>
</div>

<p>
While on the ether end:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">"surprise" EOT</span>
<span style="font-weight: bold; font-style: italic;">dat</span> = flow.get()
<span style="font-weight: bold;">if</span> <span style="font-weight: bold;">not</span> dat:
    <span style="font-weight: bold;">print</span> (<span style="font-style: italic;">"got EOT"</span>)
    flow.send_eot()
    do_clean_shutdown()
</pre>
</div>

<p>
Notes:
</p>

<ul class="org-ul">
<li>The initiator of the <b>EOT</b> should wait for a return <b>EOT</b> for as long as
"comfortable" for the application.  This assures that any queued <b>DAT</b>
messages are processed.</li>

<li>The endpoint that got the "surprise" <b>EOT</b> may return an <b>EOT</b>
immediately unless there is a reason to keep the other end "hanging"
while clean shutdown occurs.</li>

<li>Flow methods can also raise exceptions.</li>
</ul>
</div>
</div>
</div>
</body>
</html>
